FKDD_COPY_DIFF_3_2026-02-14/Reports/АнализРабочихЛистовОтделаСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>АнализРабочихЛистовОтделаСтрахования</Name>
			<Comment>Анализ рабочих листов отдела страхования</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОформленияСводнойТаблицы</Name>
					<Comment>Вариант оформления сводной таблицы</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбТипДиаграммы</Name>
					<Comment>Тип отображения диаграммы</Comment>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДетальныеЗаписиПоДокументам</Name>
					<Comment>Выводить детальные записи по документам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Comment>Имя регистра для запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойства</Name>
					<Comment>Использование в запросе свойств</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбТипСводнойДиаграммы</Name>
					<Comment>Тип отображения сводной диаграммы</Comment>
					<Type>
						<v8:Type>v8ui:PivotChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПустаяДата</Name>
					<Comment>Пустая дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>В регистре хранятся курсы валют по дням</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>Курс валюты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>Кратность валюты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Reports/АнализРабочихЛистовОтделаСтрахования/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция формирует показатель итогов
//
Функция СформироватьПоказательИтогов(Знач Путь, Знач ПоказательИтогов)
	Результат	= "";
	
	ОтборДляПоиска	= Новый Структура("ПутьКДанным, Использование",Путь, Истина);
	НайденныеСтроки	= ИзмеренияСтроки.НайтиСтроки(ОтборДляПоиска);
	Для Каждого ТекИзмерение Из НайденныеСтроки Цикл
		Результат	= Результат + "		КОГДА НЕ "+Путь+" ЕСТЬ NULL ";
		Для Индекс=ТекИзмерение.НомерСтроки По ИзмеренияСтроки.Количество()-1 Цикл
			Результат	= Результат + "И "+ИзмеренияСтроки[Индекс].ПутьКДанным+" ЕСТЬ NULL ";	
		КонецЦикла;
		Результат	= Результат + ПоказательИтогов;
		Прервать;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Функция формирует правильный текст запроса для получения итогов
//
Функция СформироватьИтоги()
	Результат	= "";
	ТекстИтога	= "";
	КоличествоРабочихЛистов	= "СУММА(ВЫБОР КОГДА ЕСТЬNULL(ТаблицаКоличества.КоличествоВсего,0)=0
								|		ТОГДА 0 ИНАЧЕ 1/ЕСТЬNULL(ТаблицаКоличества.КоличествоВсего,0) КОНЕЦ)";
	КоличествоВариантовСтрахования	= "СУММА(ЕСТЬNULL(ТаблицаПрограмм.Количество,0))";
	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("Статус","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ПодразделениеКомпании","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("МенеджерСтраховогоОтдела","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ПричинаОтказа","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("Статус","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ВидОплаты","
		|			ТОГДА "+КоличествоРабочихЛистов);
	Если НЕ ПустаяСтрока(ТекстИтога) Тогда
		ТекстОбщихИтогов	= "";
		Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
			Если ТекСтрока.Использование Тогда
				ТекстОбщихИтогов	= ТекстОбщихИтогов + "И "+ТекСтрока.ПутьКДанным+" ЕСТЬ NULL ";
			КонецЕсли;
		КонецЦикла;
		ТекстОбщихИтогов	= Сред(ТекстОбщихИтогов,2);
		ТекстОбщихИтогов	= "		КОГДА "+ТекстОбщихИтогов+"
								|			ТОГДА "+КоличествоРабочихЛистов;
		Результат	= Результат + "	ВЫБОР
			|		"+ТекстИтога+"
			|		"+ТекстОбщихИтогов+"
			|		ИНАЧЕ 0 КОНЕЦ КАК КоличествоРабочихЛистов";		
	КонецЕсли;
	
    ТекстИтога	= "";
	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("СтраховаяКомпания","
		|			ТОГДА "+КоличествоВариантовСтрахования);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ВидСтрахования","
		|			ТОГДА "+КоличествоВариантовСтрахования);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ПрограммаСтрахования","
		|			ТОГДА "+КоличествоВариантовСтрахования);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ЭтоПролонгация","
		|			ТОГДА "+КоличествоВариантовСтрахования);		
		Если НЕ ПустаяСтрока(ТекстИтога) Тогда
		ТекстОбщихИтогов	= "";
		Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
			Если ТекСтрока.Использование Тогда
				ТекстОбщихИтогов	= ТекстОбщихИтогов + "И "+ТекСтрока.ПутьКДанным+" ЕСТЬ NULL ";
			КонецЕсли;
		КонецЦикла;
		ТекстОбщихИтогов	= Сред(ТекстОбщихИтогов,2);
		ТекстОбщихИтогов	= "		КОГДА "+ТекстОбщихИтогов+"
								|			ТОГДА "+КоличествоВариантовСтрахования;			
			
		Результат	= Результат + ",
			|	ВЫБОР
			|		"+ТекстИтога+"
			|		"+ТекстОбщихИтогов+"
			|		ИНАЧЕ 0 КОНЕЦ КАК КоличествоВариантовСтрахования";		
	КонецЕсли;			
	Возврат Результат;
КонецФункции

//Возвращает ИСТИНА, если на входе тип 2-мерной диаграммы, и ЛОЖЬ - если 3-мерной
Функция ДиаграммаДвухмерная(ТипДиаграммы_)
	Возврат (ТипДиаграммы_ = ТипДиаграммы.Измерительная
	ИЛИ ТипДиаграммы_ = ТипДиаграммы.Круговая
	ИЛИ ТипДиаграммы_ = ТипДиаграммы.КруговаяОбъемная);
КонецФункции

// устанавливает основные параметры
Процедура УстановитьОсновныеПараметры()
	ПостроительОтчета.Параметры.Вставить("ДатаНач",ДатаНачала);
	ПостроительОтчета.Параметры.Вставить("ДатаКон",ДатаКонца);
КонецПроцедуры	

// Стандартная процедура настройки построителя отчета 
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	//ТекстЗамены			= СформироватьИтоги();
	//Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
	//	ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	//КонецЕсли;
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат);
	Результат.ТолькоПросмотр = обПраво("ЗащитаПечатныхФорм", глПрава);
	
	ТекстЗапроса	= ВременныйТекстЗапроса;
	
	Возврат Результат;	
КонецФункции

// формирует отчет в виде сводной таблицы
Функция СформироватьСводнуюТаблицу(ДокументРезультат=Неопределено) Экспорт
	
	КурсВалютыУпр = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКонца, Новый Структура("Валюта", Константы.ВалютаУправленческогоУчетаКомпании.Получить()));
	ПостроительОтчета.Параметры.Вставить("КурсВалютыУпр", КурсВалютыУпр.Курс/?(КурсВалютыУпр.Кратность=0,1,КурсВалютыУпр.Кратность));
		
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	ТекстЗамены				= СформироватьИтоги();
	Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
		ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
		ТекстЗапроса			= СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	КонецЕсли;
	
	отСформироватьСводнуюТаблицу(ЭтотОбъект, ДокументРезультат);	
	ТекстЗапроса	= ВременныйТекстЗапроса;	
	
	Возврат ДокументРезультат;
	
КонецФункции

// формирует диаграмму
Функция СформироватьДиаграмму(ПолеДиаграммы=Неопределено, СтруктураПараметров=Неопределено) Экспорт
	
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	ТекстЗамены				= СформироватьИтоги();
	Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
		ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
		ТекстЗапроса			= СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	КонецЕсли;
	
	отСформироватьДиаграмму(ЭтотОбъект, ПолеДиаграммы, СтруктураПараметров);
	ТекстЗапроса	= ВременныйТекстЗапроса;	
	
	Возврат ПолеДиаграммы;
	
КонецФункции

// формирует отчет в виде сводной диаграммы
Функция СформироватьСводнуюДиаграмму(ПолеСводнойДиаграммы=Неопределено) Экспорт
	
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	ТекстЗамены				= СформироватьИтоги();
	Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
		ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
		ТекстЗапроса			= СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	КонецЕсли;
	
	отСформироватьСводнуюДиаграмму(ЭтотОбъект, ПолеСводнойДиаграммы);
	ТекстЗапроса	= ВременныйТекстЗапроса;	
	
	Возврат ПолеСводнойДиаграммы;
	
КонецФункции

// Функция возвращает структуру форматирования полей
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяРегистра = "РегистрацияЗвонковИКонтактов";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли
